In [1]:
import numpy as np
import pandas as pd

In [2]:
# create Series
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
# create DataFrame
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  1.349178 -0.553629 -0.873846  0.185791
2013-01-02 -0.672009  0.132549 -1.370588 -0.934235
2013-01-03  0.379227  0.930281 -0.203259  1.279505
2013-01-04  0.301277  0.809738  0.196165  0.392742
2013-01-05  0.913574  0.971517 -1.380110 -2.693255
2013-01-06  0.740621  1.946090  0.592849 -0.674367

In [8]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
# Viewing Data

In [12]:
df.head()

                   A         B         C         D
2013-01-01  1.349178 -0.553629 -0.873846  0.185791
2013-01-02 -0.672009  0.132549 -1.370588 -0.934235
2013-01-03  0.379227  0.930281 -0.203259  1.279505
2013-01-04  0.301277  0.809738  0.196165  0.392742
2013-01-05  0.913574  0.971517 -1.380110 -2.693255

In [13]:
df.tail()

                   A         B         C         D
2013-01-02 -0.672009  0.132549 -1.370588 -0.934235
2013-01-03  0.379227  0.930281 -0.203259  1.279505
2013-01-04  0.301277  0.809738  0.196165  0.392742
2013-01-05  0.913574  0.971517 -1.380110 -2.693255
2013-01-06  0.740621  1.946090  0.592849 -0.674367

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.to_numpy()

array([[ 1.3491776 , -0.55362916, -0.87384606,  0.18579096],
       [-0.67200883,  0.13254908, -1.370588  , -0.93423467],
       [ 0.37922651,  0.93028056, -0.20325855,  1.27950497],
       [ 0.30127746,  0.80973842,  0.1961649 ,  0.39274184],
       [ 0.91357432,  0.97151711, -1.38011038, -2.693255  ],
       [ 0.74062102,  1.94609009,  0.59284921, -0.67436658]])

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.501978  0.706091 -0.506465 -0.407303
std    0.689595  0.846746  0.829343  1.371985
min   -0.672009 -0.553629 -1.380110 -2.693255
25%    0.320765  0.301846 -1.246403 -0.869268
50%    0.559924  0.870009 -0.538552 -0.244288
75%    0.870336  0.961208  0.096309  0.341004
max    1.349178  1.946090  0.592849  1.279505

In [18]:
#转置
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.349178   -0.672009    0.379227    0.301277    0.913574    0.740621
B   -0.553629    0.132549    0.930281    0.809738    0.971517    1.946090
C   -0.873846   -1.370588   -0.203259    0.196165   -1.380110    0.592849
D    0.185791   -0.934235    1.279505    0.392742   -2.693255   -0.674367

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.185791 -0.873846 -0.553629  1.349178
2013-01-02 -0.934235 -1.370588  0.132549 -0.672009
2013-01-03  1.279505 -0.203259  0.930281  0.379227
2013-01-04  0.392742  0.196165  0.809738  0.301277
2013-01-05 -2.693255 -1.380110  0.971517  0.913574
2013-01-06 -0.674367  0.592849  1.946090  0.740621

In [20]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  1.349178 -0.553629 -0.873846  0.185791
2013-01-02 -0.672009  0.132549 -1.370588 -0.934235
2013-01-04  0.301277  0.809738  0.196165  0.392742
2013-01-03  0.379227  0.930281 -0.203259  1.279505
2013-01-05  0.913574  0.971517 -1.380110 -2.693255
2013-01-06  0.740621  1.946090  0.592849 -0.674367

In [21]:
#Selection

In [22]:
#Getting

In [23]:
df['A']

2013-01-01    1.349178
2013-01-02   -0.672009
2013-01-03    0.379227
2013-01-04    0.301277
2013-01-05    0.913574
2013-01-06    0.740621
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01  1.349178 -0.553629 -0.873846  0.185791
2013-01-02 -0.672009  0.132549 -1.370588 -0.934235
2013-01-03  0.379227  0.930281 -0.203259  1.279505

In [25]:
df['20130102': '20130104']

                   A         B         C         D
2013-01-02 -0.672009  0.132549 -1.370588 -0.934235
2013-01-03  0.379227  0.930281 -0.203259  1.279505
2013-01-04  0.301277  0.809738  0.196165  0.392742

In [26]:
# Selection by Label

In [27]:
df.loc[dates[0]]

A    1.349178
B   -0.553629
C   -0.873846
D    0.185791
Name: 2013-01-01 00:00:00, dtype: float64

In [28]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  1.349178 -0.553629
2013-01-02 -0.672009  0.132549
2013-01-03  0.379227  0.930281
2013-01-04  0.301277  0.809738
2013-01-05  0.913574  0.971517
2013-01-06  0.740621  1.946090

In [29]:
df.loc['20130102': '20130104', ['A','B']]

                   A         B
2013-01-02 -0.672009  0.132549
2013-01-03  0.379227  0.930281
2013-01-04  0.301277  0.809738

In [30]:
df.loc['20130102', ['A', 'B']]

A   -0.672009
B    0.132549
Name: 2013-01-02 00:00:00, dtype: float64

In [31]:
df.loc[dates[0], 'A']

1.3491775992785484

In [32]:
#Selection by Position

In [33]:
df.iloc[3]

A    0.301277
B    0.809738
C    0.196165
D    0.392742
Name: 2013-01-04 00:00:00, dtype: float64

In [34]:
df.iloc[2:5, 0:2]

                   A         B
2013-01-03  0.379227  0.930281
2013-01-04  0.301277  0.809738
2013-01-05  0.913574  0.971517

In [35]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.672009  0.132549 -1.370588 -0.934235
2013-01-03  0.379227  0.930281 -0.203259  1.279505

In [36]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.553629 -0.873846
2013-01-02  0.132549 -1.370588
2013-01-03  0.930281 -0.203259
2013-01-04  0.809738  0.196165
2013-01-05  0.971517 -1.380110
2013-01-06  1.946090  0.592849

In [37]:
df.iloc[1, 1]

0.13254907555170156

In [38]:
#Boolean Indexing

In [39]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.349178 -0.553629 -0.873846  0.185791
2013-01-03  0.379227  0.930281 -0.203259  1.279505
2013-01-04  0.301277  0.809738  0.196165  0.392742
2013-01-05  0.913574  0.971517 -1.380110 -2.693255
2013-01-06  0.740621  1.946090  0.592849 -0.674367

In [40]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.349178       NaN       NaN  0.185791
2013-01-02       NaN  0.132549       NaN       NaN
2013-01-03  0.379227  0.930281       NaN  1.279505
2013-01-04  0.301277  0.809738  0.196165  0.392742
2013-01-05  0.913574  0.971517       NaN       NaN
2013-01-06  0.740621  1.946090  0.592849       NaN

In [41]:
df2 = df.copy()

In [42]:
df2

                   A         B         C         D
2013-01-01  1.349178 -0.553629 -0.873846  0.185791
2013-01-02 -0.672009  0.132549 -1.370588 -0.934235
2013-01-03  0.379227  0.930281 -0.203259  1.279505
2013-01-04  0.301277  0.809738  0.196165  0.392742
2013-01-05  0.913574  0.971517 -1.380110 -2.693255
2013-01-06  0.740621  1.946090  0.592849 -0.674367

In [43]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [44]:
df2

                   A         B         C         D      E
2013-01-01  1.349178 -0.553629 -0.873846  0.185791    one
2013-01-02 -0.672009  0.132549 -1.370588 -0.934235    one
2013-01-03  0.379227  0.930281 -0.203259  1.279505    two
2013-01-04  0.301277  0.809738  0.196165  0.392742  three
2013-01-05  0.913574  0.971517 -1.380110 -2.693255   four
2013-01-06  0.740621  1.946090  0.592849 -0.674367  three

In [45]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.379227  0.930281 -0.203259  1.279505   two
2013-01-05  0.913574  0.971517 -1.380110 -2.693255  four

In [46]:
#Setting

In [47]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [48]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [49]:
df['F'] = s1

In [50]:
df

                   A         B         C         D    F
2013-01-01  1.349178 -0.553629 -0.873846  0.185791  NaN
2013-01-02 -0.672009  0.132549 -1.370588 -0.934235  1.0
2013-01-03  0.379227  0.930281 -0.203259  1.279505  2.0
2013-01-04  0.301277  0.809738  0.196165  0.392742  3.0
2013-01-05  0.913574  0.971517 -1.380110 -2.693255  4.0
2013-01-06  0.740621  1.946090  0.592849 -0.674367  5.0

In [51]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [52]:
df

                   A         B         C  D    F
2013-01-01  1.349178 -0.553629 -0.873846  5  NaN
2013-01-02 -0.672009  0.132549 -1.370588  5  1.0
2013-01-03  0.379227  0.930281 -0.203259  5  2.0
2013-01-04  0.301277  0.809738  0.196165  5  3.0
2013-01-05  0.913574  0.971517 -1.380110  5  4.0
2013-01-06  0.740621  1.946090  0.592849  5  5.0

In [53]:
df2 = df.copy()

In [54]:
-df2

                   A         B         C    D    F
2013-01-01 -1.349178  0.553629  0.873846 -5.0  NaN
2013-01-02  0.672009 -0.132549  1.370588 -5.0 -1.0
2013-01-03 -0.379227 -0.930281  0.203259 -5.0 -2.0
2013-01-04 -0.301277 -0.809738 -0.196165 -5.0 -3.0
2013-01-05 -0.913574 -0.971517  1.380110 -5.0 -4.0
2013-01-06 -0.740621 -1.946090 -0.592849 -5.0 -5.0

In [55]:
df2[df2 > 0] = -df2

In [56]:
df2

                   A         B         C  D    F
2013-01-01 -1.349178 -0.553629 -0.873846 -5  NaN
2013-01-02 -0.672009 -0.132549 -1.370588 -5 -1.0
2013-01-03 -0.379227 -0.930281 -0.203259 -5 -2.0
2013-01-04 -0.301277 -0.809738 -0.196165 -5 -3.0
2013-01-05 -0.913574 -0.971517 -1.380110 -5 -4.0
2013-01-06 -0.740621 -1.946090 -0.592849 -5 -5.0

In [57]:
# Missing Data

In [58]:
df

                   A         B         C  D    F
2013-01-01  1.349178 -0.553629 -0.873846  5  NaN
2013-01-02 -0.672009  0.132549 -1.370588  5  1.0
2013-01-03  0.379227  0.930281 -0.203259  5  2.0
2013-01-04  0.301277  0.809738  0.196165  5  3.0
2013-01-05  0.913574  0.971517 -1.380110  5  4.0
2013-01-06  0.740621  1.946090  0.592849  5  5.0

In [59]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [60]:
df1

                   A         B         C  D    F   E
2013-01-01  1.349178 -0.553629 -0.873846  5  NaN NaN
2013-01-02 -0.672009  0.132549 -1.370588  5  1.0 NaN
2013-01-03  0.379227  0.930281 -0.203259  5  2.0 NaN
2013-01-04  0.301277  0.809738  0.196165  5  3.0 NaN

In [61]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [62]:
df1

                   A         B         C  D    F    E
2013-01-01  1.349178 -0.553629 -0.873846  5  NaN  1.0
2013-01-02 -0.672009  0.132549 -1.370588  5  1.0  1.0
2013-01-03  0.379227  0.930281 -0.203259  5  2.0  NaN
2013-01-04  0.301277  0.809738  0.196165  5  3.0  NaN

In [63]:
#删除有缺失值的数据行
#To drop any rows that have missing data.
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.672009  0.132549 -1.370588  5  1.0  1.0

In [64]:
#填充缺失值
#Filling missing data
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  1.349178 -0.553629 -0.873846  5  5.0  1.0
2013-01-02 -0.672009  0.132549 -1.370588  5  1.0  1.0
2013-01-03  0.379227  0.930281 -0.203259  5  2.0  5.0
2013-01-04  0.301277  0.809738  0.196165  5  3.0  5.0

In [65]:
#是NaN则为True,不是缺失值则为False
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [66]:
#Operations

In [67]:
#Stats

In [68]:
#列平均数
df.mean()

A    0.501978
B    0.706091
C   -0.506465
D    5.000000
F    3.000000
dtype: float64

In [69]:
#行平均数
df.mean(1)

2013-01-01    1.230426
2013-01-02    0.817990
2013-01-03    1.621250
2013-01-04    1.861436
2013-01-05    1.900996
2013-01-06    2.655912
Freq: D, dtype: float64

In [80]:
#从不同的维度对齐数据
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(1)

In [81]:
s

2013-01-01    NaN
2013-01-02    1.0
2013-01-03    3.0
2013-01-04    5.0
2013-01-05    NaN
2013-01-06    6.0
Freq: D, dtype: float64

In [82]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02 -1.672009 -0.867451 -2.370588  4.0  0.0
2013-01-03 -2.620773 -2.069719 -3.203259  2.0 -1.0
2013-01-04 -4.698723 -4.190262 -4.803835  0.0 -2.0
2013-01-05       NaN       NaN       NaN  NaN  NaN
2013-01-06 -5.259379 -4.053910 -5.407151 -1.0 -1.0

In [83]:
#Apply
#将函数应用到数据上

In [84]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  1.349178 -0.553629 -0.873846   5   NaN
2013-01-02  0.677169 -0.421080 -2.244434  10   1.0
2013-01-03  1.056395  0.509200 -2.447693  15   3.0
2013-01-04  1.357673  1.318939 -2.251528  20   6.0
2013-01-05  2.271247  2.290456 -3.631638  25  10.0
2013-01-06  3.011868  4.236546 -3.038789  30  15.0